In [1]:
import pandas as pd

In [3]:
dict1 = {'Name' : ['Luthfi','Adnan','Rahman','Tyo','Abiyyu','Raditya','Naufal' 
                   ],
         'Score' : [90, 89, 80, 99, 87, 83, 95],
         'Gender' : ['Male','Female','Male','Male','Female','Female',
                    'Male']
    
        }
df1=pd.DataFrame(dict1) #Untuk Membuat DataFrame
df1

      Name  Score  Gender
0   Luthfi     90    Male
1    Adnan     89  Female
2   Rahman     80    Male
3      Tyo     99    Male
4   Abiyyu     87  Female
5  Raditya     83  Female
6   Naufal     95    Male

## 1. Menampilkan 3 Kolom Teratas Dari Dataset

In [5]:
df1.head(3) #Secara default fungsi tersebut menampilkan 5 data teratas dari Dataset

     Name  Score  Gender
0  Luthfi     90    Male
1   Adnan     89  Female
2  Rahman     80    Male

## 2.Menampilkan 3 kolom terbawah dari dataset

In [7]:
df1.tail(3)

      Name  Score  Gender
4   Abiyyu     87  Female
5  Raditya     83  Female
6   Naufal     95    Male

## 3. Menampilkan Bentuk dari Dataset (Berisi Jumlah baris dan Kolom)

In [9]:
df1.shape #shape bukan method melaikan Attribute dan menampilkan tuple

(7, 3)

In [12]:
print('Number of Rows', df1.shape[0])
print('Number of Columns', df1.shape[1]) #Menampilkan data melaui tuple ke-1

Number of Rows 7
Number of Columns 3

## 4. Mendapatkan informasi mengenai Dataset seperti total baris, total number, tipedata berdasrkan kolom dan "Memori Requrement"